[Killed] BlockStatement
src/error/NegocioErro.ts:5:33
 
 export class NegocioErro extends Error {
 
-    constructor(message: string){
-        super(message);
-        Object.setPrototypeOf(this, NegocioErro.prototype);
-    }
+    constructor(message: string){}
 }
 
killedBy: Transferencia serviço mock conta de origem não encontrada
statusReason: Error: expect(received).rejects.toEqual(expected) // deep equality

Expected: [Error: conta de origem não encontrada]
Received: [ReferenceError: Must call super constructor in derived class before accessing 'this' or returning from derived constructor]
