[Killed] BlockStatement
src/model/Conta.ts:9:48
     private _saldo: number;
     private _numeroConta: NumeroConta;
 
-    constructor(numero: string, saldo: number) {
-        this._saldo = saldo;
-        this._numeroConta = new NumeroConta(numero);
-    }
+    constructor(numero: string, saldo: number) {}
 
 
killedBy: Transferencia serviço mock transferir com sucesso
statusReason: TypeError: Cannot read properties of undefined (reading 'numero')

[Killed] BlockStatement
src/model/Conta.ts:15:38
     }
 
 
-    public sacar(quantidade: number) {
-        this.validarValor(quantidade);
-        if (this._saldo < quantidade) throw new NegocioErro("Valor precisa ser menor ou igual ao Saldo.");
-        this._saldo -= quantidade;
-    }
+    public sacar(quantidade: number) {}
 
     depositar(quantidade: number) {
killedBy: Transferencia serviço mock transferir com sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4900
Received: 5000

[Killed] EqualityOperator
src/model/Conta.ts:17:13
 
     public sacar(quantidade: number) {
         this.validarValor(quantidade);
-        if (this._saldo < quantidade) throw new NegocioErro("Valor precisa ser menor ou igual ao Saldo.");
+        if (this._saldo <= quantidade) throw new NegocioErro("Valor precisa ser menor ou igual ao Saldo.");
         this._saldo -= quantidade;
     }
killedBy: Conta sacar todo o saldo
statusReason: Error: Valor precisa ser menor ou igual ao Saldo.

[Killed] EqualityOperator
src/model/Conta.ts:17:13
 
     public sacar(quantidade: number) {
         this.validarValor(quantidade);
-        if (this._saldo < quantidade) throw new NegocioErro("Valor precisa ser menor ou igual ao Saldo.");
+        if (this._saldo >= quantidade) throw new NegocioErro("Valor precisa ser menor ou igual ao Saldo.");
         this._saldo -= quantidade;
     }
killedBy: Transferencia serviço mock transferir com sucesso
statusReason: Error: Valor precisa ser menor ou igual ao Saldo.

[Killed] AssignmentOperator
src/model/Conta.ts:18:9
     public sacar(quantidade: number) {
         this.validarValor(quantidade);
         if (this._saldo < quantidade) throw new NegocioErro("Valor precisa ser menor ou igual ao Saldo.");
-        this._saldo -= quantidade;
+        this._saldo += quantidade;
     }
 
killedBy: Transferencia serviço mock transferir com sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4900
Received: 5100

[Killed] BlockStatement
src/model/Conta.ts:21:35
         this._saldo -= quantidade;
     }
 
-    depositar(quantidade: number) {
-        this.validarValor(quantidade);
-        this._saldo += quantidade;
-    }
+    depositar(quantidade: number) {}
 
     private validarValor(valor: number): void {
killedBy: Transferencia serviço mock transferir com sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5100
Received: 5000

[Killed] AssignmentOperator
src/model/Conta.ts:23:9
 
     depositar(quantidade: number) {
         this.validarValor(quantidade);
-        this._saldo += quantidade;
+        this._saldo -= quantidade;
     }
 
killedBy: Transferencia serviço mock transferir com sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5100
Received: 4900

[Killed] BlockStatement
src/model/Conta.ts:26:47
         this._saldo += quantidade;
     }
 
-    private validarValor(valor: number): void {
-        if (valor <= 0)
-            throw new NegocioErro("Valor precisa ser maior que zero.");
-    }
+    private validarValor(valor: number): void {}
 
     public get saldo(): number {
killedBy: Conta validar saque zerado
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Valor precisa ser maior que zero."

Received function did not throw

[Killed] EqualityOperator
src/model/Conta.ts:27:13
     }
 
     private validarValor(valor: number): void {
-        if (valor <= 0)
+        if (valor < 0)
             throw new NegocioErro("Valor precisa ser maior que zero.");
     }
killedBy: Conta validar saque zerado
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Valor precisa ser maior que zero."

Received function did not throw
