[Killed] BooleanLiteral
src/model/NumeroConta.ts:12:12
     }
     
     private validar(numero: string): void {
-        if(!this.temSeisDigitos(numero)) {
+        if(this.temSeisDigitos(numero)) {
             throw new NegocioErro("número de conta inválida");
         }
killedBy: Conta sacar com sucesso
statusReason: Error: número de conta inválida

[Killed] Regex
src/model/NumeroConta.ts:18:32
     }
     
     private temSeisDigitos(numero: string): boolean {
-        const regExp: RegExp = /^\d{6}$/;
+        const regExp: RegExp = /\d{6}$/;
         return regExp.test(numero);
     }
killedBy: Número Conta conta com sete dígitos
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "número de conta inválida"

Received function did not throw

[Killed] Regex
src/model/NumeroConta.ts:18:32
     }
     
     private temSeisDigitos(numero: string): boolean {
-        const regExp: RegExp = /^\d{6}$/;
+        const regExp: RegExp = /^\d$/;
         return regExp.test(numero);
     }
killedBy: Transferencia serviço mock transferir com sucesso
statusReason: Error: número de conta inválida
