[Killed] BlockStatement
src/model/TransferenciaValor.ts:5:87
 import { Recibo } from "./Recibo";
 
 export class TransferenciaValor {
-    public transferir(contaOrigem: Conta, contaDestino: Conta, valor: number): Recibo {
-        contaOrigem.sacar(valor);
-        contaDestino.depositar(valor);
-        return new Recibo();
-    }
+    public transferir(contaOrigem: Conta, contaDestino: Conta, valor: number): Recibo {}
 }
killedBy: Transferencia serviço mock transferir com sucesso
statusReason: TypeError: Cannot read properties of undefined (reading 'codigo')
